export const REG_EXP_FIO = /^[А-ЯЁ][а-яё]*([-][А-ЯЁ][а-яё]*)*\s[А-ЯЁ][а-яё]*([-][А-ЯЁ][а-яё]*)*\s[А-ЯЁ][а-яё]*([-][А-ЯЁ][а-яё]*)*$/;

export const REG_EXP_EMAIL = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;

export const LABELS = {
  FIO: 'ФИО',
  TEL: 'Телефон',
  EMAIL: 'Email',
  DATE: 'Дата'
};

export const ERRORS = {
  FIO: 'Введите корректное имя.',
  TEL: 'Введите корректный номер телефона.',
  EMAIL: 'Введите корректную почту.',
  DATE: 'Введите корректную дату.'
};